In [1]:
# linear algebra
import numpy as np

In [2]:
# data processing
import pandas as pd

In [3]:
# data visualization
import seaborn as sns
%matplotlib inline
from matplotlib import pyplot as plt
from matplotlib import style

In [4]:
# Algorithms
from sklearn import linear_model
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC, LinearSVC
from sklearn.naive_bayes import GaussianNB

In [5]:
gender_submission_df = pd.read_csv(r"E:\siva\algo\dspy\session\gender_submission_titanic.csv")
test_df = pd.read_csv(r"E:\siva\algo\dspy\session\test_titanic.csv")
train_df = pd.read_csv(r"E:\siva\algo\dspy\session\train_titanic.csv")

In [47]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

survival:   Survival    
PassengerId: Unique Id of a passenger.    
pclass: Ticket class    
sex:    Sex 
Age:    Age in years    
sibsp:  # of siblings / spouses aboard the Titanic  
parch:  # of parents / children aboard the Titanic  
ticket: Ticket number   
fare:   Passenger fare  
cabin:  Cabin number    
embarked:   Port of Embarkation

In [48]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [49]:
train_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [54]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
# null values in each column
train_df.isnull().sum()

In [ ]:
# null values in each column in ascending order
train_df.isnull().sum().sort_values(ascending=False)

In [ ]:
print(train_df.shape)
train_df.shape[0]

In [ ]:
train_df.isnull().sum()/train_df.shape[0]*100

In [ ]:
total = train_df.isnull().sum().sort_values(ascending=False)

percent_1 = train_df.isnull().sum()/train_df.shape[0]*100

percent_2 = (round(percent_1, 2)).sort_values(ascending=False)

percentage_missing_data = pd.concat([total, percent_2,total_values], axis=1, keys=["total_number_missing","%"]) # axis = 1 to keep things vertically
percentage_missing_data["total_values"] = train_df.shape[0]
percentage_missing_data

In [ ]:
train_df.columns.values

In [ ]:
survived = 'survived'
not_survived = 'not survived'

In [ ]:
women = train_df[train_df['Sex']=='female']
men = train_df[train_df['Sex']=='male']

In [ ]:
plt.figure(figsize=(20,20))
ax = sns.histplot(data= women, x = "Age", hue="Survived", multiple="dodge", shrink=0.9, kde=False)
ax.set_title('Female')
ax.set_xbound(0,int(women["Age"].max())+10)
ax.set_xticks(list(range(0,int(women["Age"].max())+5,5)))

plt.figure(figsize=(20,20))
ax1 = sns.histplot(data= men, x = "Age", hue="Survived", multiple="dodge", shrink=0.9, kde=False)
ax1.set_title('male')
ax1.set_xbound(0,int(men["Age"].max())+10)
ax1.set_xticks(list(range(0,int(men["Age"].max())+5,5)))

In [ ]:
fig, axes = plt.subplots(nrows=2, ncols=1,figsize=(20, 20))

ax = sns.histplot(women[women['Survived']==1].Age.dropna(),shrink=0.45, bins=list(range(0,int(women["Age"].max())+5,5)), label = survived, ax = axes[0],color="red")
ax = sns.histplot(women[women['Survived']==0].Age.dropna(),shrink=0.45, bins=list(range(0,int(women["Age"].max())+5,5)), label = not_survived, ax = axes[0],color="green")
ax.legend()
ax.set_title('Female')
ax.set_xbound(0,int(women["Age"].max())+10)
ax.set_xticks(list(range(0,int(women["Age"].max())+5,5)))

ax = sns.histplot(men[men['Survived']==1].Age.dropna(), bins=list(range(0,int(men["Age"].max())+5,5)), label = survived, ax = axes[1], color="red")
ax = sns.histplot(men[men['Survived']==0].Age.dropna(), bins=list(range(0,int(men["Age"].max())+5,5)), label = not_survived, ax = axes[1], color="green")
ax.legend()
ax.set_title('Male')
ax.set_xbound(0,int(men["Age"].max())+10)
ax.set_xticks(list(range(0,int(men["Age"].max())+5,5)))

In [ ]:
for d in list(train_df.columns):
    train_df[d].unique()

In [ ]:
FacetGrid = sns.FacetGrid(train_df, row='Embarked', size=4.5, aspect=1.6)
FacetGrid.map(sns.pointplot, 'Pclass', 'Survived', 'Sex', palette=None,  order=None, hue_order=None )
FacetGrid.add_legend()